espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/gpio_reg.h
/** GPIO_FUNC55_OUT_SEL_CFG_REG register
 *  GPIO output function select register
 */
#define GPIO_FUNC55_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x634)
/** GPIO_FUNC55_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  The value of the bits: 0<=s<=256. Set the value to select output signal. s=0-255:
 *  output of GPIO[n] equals input of peripheral[s]. s=256: output of GPIO[n] equals
 *  GPIO_OUT_REG[n].
 */
#define GPIO_FUNC55_OUT_SEL    0x000001FFU
#define GPIO_FUNC55_OUT_SEL_M  (GPIO_FUNC55_OUT_SEL_V << GPIO_FUNC55_OUT_SEL_S)
#define GPIO_FUNC55_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC55_OUT_SEL_S  0
/** GPIO_FUNC55_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  set this bit to invert output signal.1:invert.0:not invert.
 */
#define GPIO_FUNC55_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC55_OUT_INV_SEL_M  (GPIO_FUNC55_OUT_INV_SEL_V << GPIO_FUNC55_OUT_INV_SEL_S)
#define GPIO_FUNC55_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC55_OUT_INV_SEL_S  9
/** GPIO_FUNC55_OEN_SEL : R/W; bitpos: [10]; default: 0;
 *  set this bit to select output enable signal.1:use GPIO_ENABLE_REG[n] as output
 *  enable signal.0:use peripheral output enable signal.
 */
#define GPIO_FUNC55_OEN_SEL    (BIT(10))
#define GPIO_FUNC55_OEN_SEL_M  (GPIO_FUNC55_OEN_SEL_V << GPIO_FUNC55_OEN_SEL_S)
#define GPIO_FUNC55_OEN_SEL_V  0x00000001U
#define GPIO_FUNC55_OEN_SEL_S  10
/** GPIO_FUNC55_OEN_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  set this bit to invert output enable signal.1:invert.0:not invert.
 */
#define GPIO_FUNC55_OEN_INV_SEL    (BIT(11))
#define GPIO_FUNC55_OEN_INV_SEL_M  (GPIO_FUNC55_OEN_INV_SEL_V << GPIO_FUNC55_OEN_INV_SEL_S)
#define GPIO_FUNC55_OEN_INV_SEL_V  0x00000001U
#define GPIO_FUNC55_OEN_INV_SEL_S  11

/** GPIO_FUNC56_OUT_SEL_CFG_REG register
 *  GPIO output function select register
 */
#define GPIO_FUNC56_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x638)
/** GPIO_FUNC56_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  The value of the bits: 0<=s<=256. Set the value to select output signal. s=0-255:
 *  output of GPIO[n] equals input of peripheral[s]. s=256: output of GPIO[n] equals
 *  GPIO_OUT_REG[n].
 */
#define GPIO_FUNC56_OUT_SEL    0x000001FFU
#define GPIO_FUNC56_OUT_SEL_M  (GPIO_FUNC56_OUT_SEL_V << GPIO_FUNC56_OUT_SEL_S)
#define GPIO_FUNC56_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC56_OUT_SEL_S  0
/** GPIO_FUNC56_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  set this bit to invert output signal.1:invert.0:not invert.
 */
#define GPIO_FUNC56_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC56_OUT_INV_SEL_M  (GPIO_FUNC56_OUT_INV_SEL_V << GPIO_FUNC56_OUT_INV_SEL_S)
#define GPIO_FUNC56_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC56_OUT_INV_SEL_S  9
/** GPIO_FUNC56_OEN_SEL : R/W; bitpos: [10]; default: 0;
 *  set this bit to select output enable signal.1:use GPIO_ENABLE_REG[n] as output
 *  enable signal.0:use peripheral output enable signal.
 */
#define GPIO_FUNC56_OEN_SEL    (BIT(10))
#define GPIO_FUNC56_OEN_SEL_M  (GPIO_FUNC56_OEN_SEL_V << GPIO_FUNC56_OEN_SEL_S)
#define GPIO_FUNC56_OEN_SEL_V  0x00000001U
#define GPIO_FUNC56_OEN_SEL_S  10
/** GPIO_FUNC56_OEN_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  set this bit to invert output enable signal.1:invert.0:not invert.
 */
#define GPIO_FUNC56_OEN_INV_SEL    (BIT(11))
#define GPIO_FUNC56_OEN_INV_SEL_M  (GPIO_FUNC56_OEN_INV_SEL_V << GPIO_FUNC56_OEN_INV_SEL_S)
#define GPIO_FUNC56_OEN_INV_SEL_V  0x00000001U
#define GPIO_FUNC56_OEN_INV_SEL_S  11

/** GPIO_INTR_2_REG register
 *  GPIO interrupt 2 status register for GPIO0-31
 */
#define GPIO_INTR_2_REG (DR_REG_GPIO_BASE + 0x63c)
/** GPIO_INT_2 : RO; bitpos: [31:0]; default: 0;
 *  GPIO interrupt 2 status register for GPIO0-31
 */
#define GPIO_INT_2    0xFFFFFFFFU
#define GPIO_INT_2_M  (GPIO_INT_2_V << GPIO_INT_2_S)
#define GPIO_INT_2_V  0xFFFFFFFFU
#define GPIO_INT_2_S  0

/** GPIO_INTR1_2_REG register
 *  GPIO interrupt 2 status register for GPIO32-56
 */
#define GPIO_INTR1_2_REG (DR_REG_GPIO_BASE + 0x640)
/** GPIO_INT1_2 : RO; bitpos: [24:0]; default: 0;
 *  GPIO interrupt 2 status register for GPIO32-56
 */
#define GPIO_INT1_2    0x01FFFFFFU
#define GPIO_INT1_2_M  (GPIO_INT1_2_V << GPIO_INT1_2_S)
#define GPIO_INT1_2_V  0x01FFFFFFU
#define GPIO_INT1_2_S  0

/** GPIO_INTR_3_REG register
 *  GPIO interrupt 3 status register for GPIO0-31
 */
#define GPIO_INTR_3_REG (DR_REG_GPIO_BASE + 0x644)
/** GPIO_INT_3 : RO; bitpos: [31:0]; default: 0;
 *  GPIO interrupt 3 status register for GPIO0-31
 */
#define GPIO_INT_3    0xFFFFFFFFU
#define GPIO_INT_3_M  (GPIO_INT_3_V << GPIO_INT_3_S)
#define GPIO_INT_3_V  0xFFFFFFFFU
#define GPIO_INT_3_S  0

/** GPIO_INTR1_3_REG register
 *  GPIO interrupt 3 status register for GPIO32-56
 */
#define GPIO_INTR1_3_REG (DR_REG_GPIO_BASE + 0x648)
/** GPIO_INT1_3 : RO; bitpos: [24:0]; default: 0;
 *  GPIO interrupt 3 status register for GPIO32-56
 */
#define GPIO_INT1_3    0x01FFFFFFU
#define GPIO_INT1_3_M  (GPIO_INT1_3_V << GPIO_INT1_3_S)
#define GPIO_INT1_3_V  0x01FFFFFFU
#define GPIO_INT1_3_S  0

/** GPIO_CLOCK_GATE_REG register
 *  GPIO clock gate register
 */
#define GPIO_CLOCK_GATE_REG (DR_REG_GPIO_BASE + 0x64c)
/** GPIO_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  set this bit to enable GPIO clock gate
 */
#define GPIO_CLK_EN    (BIT(0))
#define GPIO_CLK_EN_M  (GPIO_CLK_EN_V << GPIO_CLK_EN_S)
#define GPIO_CLK_EN_V  0x00000001U
#define GPIO_CLK_EN_S  0

/** GPIO_INT_RAW_REG register
 *  analog comparator interrupt raw
 */
#define GPIO_INT_RAW_REG (DR_REG_GPIO_BASE + 0x700)
/** GPIO_COMP0_NEG_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  analog comparator pos edge interrupt raw
 */
#define GPIO_COMP0_NEG_INT_RAW    (BIT(0))
#define GPIO_COMP0_NEG_INT_RAW_M  (GPIO_COMP0_NEG_INT_RAW_V << GPIO_COMP0_NEG_INT_RAW_S)
#define GPIO_COMP0_NEG_INT_RAW_V  0x00000001U
#define GPIO_COMP0_NEG_INT_RAW_S  0
/** GPIO_COMP0_POS_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  analog comparator neg edge interrupt raw
 */
#define GPIO_COMP0_POS_INT_RAW    (BIT(1))
#define GPIO_COMP0_POS_INT_RAW_M  (GPIO_COMP0_POS_INT_RAW_V << GPIO_COMP0_POS_INT_RAW_S)
#define GPIO_COMP0_POS_INT_RAW_V  0x00000001U
#define GPIO_COMP0_POS_INT_RAW_S  1
/** GPIO_COMP0_ALL_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  analog comparator neg or pos edge interrupt raw
 */
#define GPIO_COMP0_ALL_INT_RAW    (BIT(2))
#define GPIO_COMP0_ALL_INT_RAW_M  (GPIO_COMP0_ALL_INT_RAW_V << GPIO_COMP0_ALL_INT_RAW_S)
#define GPIO_COMP0_ALL_INT_RAW_V  0x00000001U
#define GPIO_COMP0_ALL_INT_RAW_S  2
/** GPIO_COMP1_NEG_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  analog comparator pos edge interrupt raw
 */
#define GPIO_COMP1_NEG_INT_RAW    (BIT(3))
#define GPIO_COMP1_NEG_INT_RAW_M  (GPIO_COMP1_NEG_INT_RAW_V << GPIO_COMP1_NEG_INT_RAW_S)
#define GPIO_COMP1_NEG_INT_RAW_V  0x00000001U
#define GPIO_COMP1_NEG_INT_RAW_S  3
/** GPIO_COMP1_POS_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  analog comparator neg edge interrupt raw
 */
#define GPIO_COMP1_POS_INT_RAW    (BIT(4))
#define GPIO_COMP1_POS_INT_RAW_M  (GPIO_COMP1_POS_INT_RAW_V << GPIO_COMP1_POS_INT_RAW_S)
#define GPIO_COMP1_POS_INT_RAW_V  0x00000001U
#define GPIO_COMP1_POS_INT_RAW_S  4
/** GPIO_COMP1_ALL_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  analog comparator neg or pos edge interrupt raw
 */
#define GPIO_COMP1_ALL_INT_RAW    (BIT(5))
#define GPIO_COMP1_ALL_INT_RAW_M  (GPIO_COMP1_ALL_INT_RAW_V << GPIO_COMP1_ALL_INT_RAW_S)
#define GPIO_COMP1_ALL_INT_RAW_V  0x00000001U
#define GPIO_COMP1_ALL_INT_RAW_S  5
/** GPIO_BISTOK_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  pad bistok interrupt raw
 */
#define GPIO_BISTOK_INT_RAW    (BIT(6))
#define GPIO_BISTOK_INT_RAW_M  (GPIO_BISTOK_INT_RAW_V << GPIO_BISTOK_INT_RAW_S)
#define GPIO_BISTOK_INT_RAW_V  0x00000001U
#define GPIO_BISTOK_INT_RAW_S  6
/** GPIO_BISTFAIL_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  pad bistfail interrupt raw
 */
#define GPIO_BISTFAIL_INT_RAW    (BIT(7))
#define GPIO_BISTFAIL_INT_RAW_M  (GPIO_BISTFAIL_INT_RAW_V << GPIO_BISTFAIL_INT_RAW_S)
#define GPIO_BISTFAIL_INT_RAW_V  0x00000001U
#define GPIO_BISTFAIL_INT_RAW_S  7

/** GPIO_INT_ST_REG register
 *  analog comparator interrupt status
 */
#define GPIO_INT_ST_REG (DR_REG_GPIO_BASE + 0x704)
/** GPIO_COMP0_NEG_INT_ST : RO; bitpos: [0]; default: 0;
 *  analog comparator pos edge interrupt status
 */
#define GPIO_COMP0_NEG_INT_ST    (BIT(0))
#define GPIO_COMP0_NEG_INT_ST_M  (GPIO_COMP0_NEG_INT_ST_V << GPIO_COMP0_NEG_INT_ST_S)
#define GPIO_COMP0_NEG_INT_ST_V  0x00000001U
#define GPIO_COMP0_NEG_INT_ST_S  0
/** GPIO_COMP0_POS_INT_ST : RO; bitpos: [1]; default: 0;
 *  analog comparator neg edge interrupt status
 */
#define GPIO_COMP0_POS_INT_ST    (BIT(1))
#define GPIO_COMP0_POS_INT_ST_M  (GPIO_COMP0_POS_INT_ST_V << GPIO_COMP0_POS_INT_ST_S)
#define GPIO_COMP0_POS_INT_ST_V  0x00000001U
#define GPIO_COMP0_POS_INT_ST_S  1
/** GPIO_COMP0_ALL_INT_ST : RO; bitpos: [2]; default: 0;
 *  analog comparator neg or pos edge interrupt status
 */
#define GPIO_COMP0_ALL_INT_ST    (BIT(2))
#define GPIO_COMP0_ALL_INT_ST_M  (GPIO_COMP0_ALL_INT_ST_V << GPIO_COMP0_ALL_INT_ST_S)
#define GPIO_COMP0_ALL_INT_ST_V  0x00000001U
#define GPIO_COMP0_ALL_INT_ST_S  2
/** GPIO_COMP1_NEG_INT_ST : RO; bitpos: [3]; default: 0;
 *  analog comparator pos edge interrupt status
 */
#define GPIO_COMP1_NEG_INT_ST    (BIT(3))
#define GPIO_COMP1_NEG_INT_ST_M  (GPIO_COMP1_NEG_INT_ST_V << GPIO_COMP1_NEG_INT_ST_S)
#define GPIO_COMP1_NEG_INT_ST_V  0x00000001U
#define GPIO_COMP1_NEG_INT_ST_S  3
/** GPIO_COMP1_POS_INT_ST : RO; bitpos: [4]; default: 0;
 *  analog comparator neg edge interrupt status
 */
#define GPIO_COMP1_POS_INT_ST    (BIT(4))
#define GPIO_COMP1_POS_INT_ST_M  (GPIO_COMP1_POS_INT_ST_V << GPIO_COMP1_POS_INT_ST_S)
#define GPIO_COMP1_POS_INT_ST_V  0x00000001U
#define GPIO_COMP1_POS_INT_ST_S  4
/** GPIO_COMP1_ALL_INT_ST : RO; bitpos: [5]; default: 0;
 *  analog comparator neg or pos edge interrupt status
 */
#define GPIO_COMP1_ALL_INT_ST    (BIT(5))
#define GPIO_COMP1_ALL_INT_ST_M  (GPIO_COMP1_ALL_INT_ST_V << GPIO_COMP1_ALL_INT_ST_S)
#define GPIO_COMP1_ALL_INT_ST_V  0x00000001U
#define GPIO_COMP1_ALL_INT_ST_S  5
/** GPIO_BISTOK_INT_ST : RO; bitpos: [6]; default: 0;
 *  pad bistok interrupt status
 */
#define GPIO_BISTOK_INT_ST    (BIT(6))
#define GPIO_BISTOK_INT_ST_M  (GPIO_BISTOK_INT_ST_V << GPIO_BISTOK_INT_ST_S)
#define GPIO_BISTOK_INT_ST_V  0x00000001U
#define GPIO_BISTOK_INT_ST_S  6
/** GPIO_BISTFAIL_INT_ST : RO; bitpos: [7]; default: 0;
 *  pad bistfail interrupt status
 */
#define GPIO_BISTFAIL_INT_ST    (BIT(7))
#define GPIO_BISTFAIL_INT_ST_M  (GPIO_BISTFAIL_INT_ST_V << GPIO_BISTFAIL_INT_ST_S)
#define GPIO_BISTFAIL_INT_ST_V  0x00000001U
#define GPIO_BISTFAIL_INT_ST_S  7

