espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/gpio_reg.h
/** GPIO_INT_ENA_REG register
 *  analog comparator interrupt enable
 */
#define GPIO_INT_ENA_REG (DR_REG_GPIO_BASE + 0x708)
/** GPIO_COMP0_NEG_INT_ENA : R/W; bitpos: [0]; default: 1;
 *  analog comparator pos edge interrupt enable
 */
#define GPIO_COMP0_NEG_INT_ENA    (BIT(0))
#define GPIO_COMP0_NEG_INT_ENA_M  (GPIO_COMP0_NEG_INT_ENA_V << GPIO_COMP0_NEG_INT_ENA_S)
#define GPIO_COMP0_NEG_INT_ENA_V  0x00000001U
#define GPIO_COMP0_NEG_INT_ENA_S  0
/** GPIO_COMP0_POS_INT_ENA : R/W; bitpos: [1]; default: 1;
 *  analog comparator neg edge interrupt enable
 */
#define GPIO_COMP0_POS_INT_ENA    (BIT(1))
#define GPIO_COMP0_POS_INT_ENA_M  (GPIO_COMP0_POS_INT_ENA_V << GPIO_COMP0_POS_INT_ENA_S)
#define GPIO_COMP0_POS_INT_ENA_V  0x00000001U
#define GPIO_COMP0_POS_INT_ENA_S  1
/** GPIO_COMP0_ALL_INT_ENA : R/W; bitpos: [2]; default: 1;
 *  analog comparator neg or pos edge interrupt enable
 */
#define GPIO_COMP0_ALL_INT_ENA    (BIT(2))
#define GPIO_COMP0_ALL_INT_ENA_M  (GPIO_COMP0_ALL_INT_ENA_V << GPIO_COMP0_ALL_INT_ENA_S)
#define GPIO_COMP0_ALL_INT_ENA_V  0x00000001U
#define GPIO_COMP0_ALL_INT_ENA_S  2
/** GPIO_COMP1_NEG_INT_ENA : R/W; bitpos: [3]; default: 1;
 *  analog comparator pos edge interrupt enable
 */
#define GPIO_COMP1_NEG_INT_ENA    (BIT(3))
#define GPIO_COMP1_NEG_INT_ENA_M  (GPIO_COMP1_NEG_INT_ENA_V << GPIO_COMP1_NEG_INT_ENA_S)
#define GPIO_COMP1_NEG_INT_ENA_V  0x00000001U
#define GPIO_COMP1_NEG_INT_ENA_S  3
/** GPIO_COMP1_POS_INT_ENA : R/W; bitpos: [4]; default: 1;
 *  analog comparator neg edge interrupt enable
 */
#define GPIO_COMP1_POS_INT_ENA    (BIT(4))
#define GPIO_COMP1_POS_INT_ENA_M  (GPIO_COMP1_POS_INT_ENA_V << GPIO_COMP1_POS_INT_ENA_S)
#define GPIO_COMP1_POS_INT_ENA_V  0x00000001U
#define GPIO_COMP1_POS_INT_ENA_S  4
/** GPIO_COMP1_ALL_INT_ENA : R/W; bitpos: [5]; default: 1;
 *  analog comparator neg or pos edge interrupt enable
 */
#define GPIO_COMP1_ALL_INT_ENA    (BIT(5))
#define GPIO_COMP1_ALL_INT_ENA_M  (GPIO_COMP1_ALL_INT_ENA_V << GPIO_COMP1_ALL_INT_ENA_S)
#define GPIO_COMP1_ALL_INT_ENA_V  0x00000001U
#define GPIO_COMP1_ALL_INT_ENA_S  5
/** GPIO_BISTOK_INT_ENA : R/W; bitpos: [6]; default: 1;
 *  pad bistok interrupt enable
 */
#define GPIO_BISTOK_INT_ENA    (BIT(6))
#define GPIO_BISTOK_INT_ENA_M  (GPIO_BISTOK_INT_ENA_V << GPIO_BISTOK_INT_ENA_S)
#define GPIO_BISTOK_INT_ENA_V  0x00000001U
#define GPIO_BISTOK_INT_ENA_S  6
/** GPIO_BISTFAIL_INT_ENA : R/W; bitpos: [7]; default: 1;
 *  pad bistfail interrupt enable
 */
#define GPIO_BISTFAIL_INT_ENA    (BIT(7))
#define GPIO_BISTFAIL_INT_ENA_M  (GPIO_BISTFAIL_INT_ENA_V << GPIO_BISTFAIL_INT_ENA_S)
#define GPIO_BISTFAIL_INT_ENA_V  0x00000001U
#define GPIO_BISTFAIL_INT_ENA_S  7

/** GPIO_INT_CLR_REG register
 *  analog comparator interrupt clear
 */
#define GPIO_INT_CLR_REG (DR_REG_GPIO_BASE + 0x70c)
/** GPIO_COMP0_NEG_INT_CLR : WT; bitpos: [0]; default: 0;
 *  analog comparator pos edge interrupt clear
 */
#define GPIO_COMP0_NEG_INT_CLR    (BIT(0))
#define GPIO_COMP0_NEG_INT_CLR_M  (GPIO_COMP0_NEG_INT_CLR_V << GPIO_COMP0_NEG_INT_CLR_S)
#define GPIO_COMP0_NEG_INT_CLR_V  0x00000001U
#define GPIO_COMP0_NEG_INT_CLR_S  0
/** GPIO_COMP0_POS_INT_CLR : WT; bitpos: [1]; default: 0;
 *  analog comparator neg edge interrupt clear
 */
#define GPIO_COMP0_POS_INT_CLR    (BIT(1))
#define GPIO_COMP0_POS_INT_CLR_M  (GPIO_COMP0_POS_INT_CLR_V << GPIO_COMP0_POS_INT_CLR_S)
#define GPIO_COMP0_POS_INT_CLR_V  0x00000001U
#define GPIO_COMP0_POS_INT_CLR_S  1
/** GPIO_COMP0_ALL_INT_CLR : WT; bitpos: [2]; default: 0;
 *  analog comparator neg or pos edge interrupt clear
 */
#define GPIO_COMP0_ALL_INT_CLR    (BIT(2))
#define GPIO_COMP0_ALL_INT_CLR_M  (GPIO_COMP0_ALL_INT_CLR_V << GPIO_COMP0_ALL_INT_CLR_S)
#define GPIO_COMP0_ALL_INT_CLR_V  0x00000001U
#define GPIO_COMP0_ALL_INT_CLR_S  2
/** GPIO_COMP1_NEG_INT_CLR : WT; bitpos: [3]; default: 0;
 *  analog comparator pos edge interrupt clear
 */
#define GPIO_COMP1_NEG_INT_CLR    (BIT(3))
#define GPIO_COMP1_NEG_INT_CLR_M  (GPIO_COMP1_NEG_INT_CLR_V << GPIO_COMP1_NEG_INT_CLR_S)
#define GPIO_COMP1_NEG_INT_CLR_V  0x00000001U
#define GPIO_COMP1_NEG_INT_CLR_S  3
/** GPIO_COMP1_POS_INT_CLR : WT; bitpos: [4]; default: 0;
 *  analog comparator neg edge interrupt clear
 */
#define GPIO_COMP1_POS_INT_CLR    (BIT(4))
#define GPIO_COMP1_POS_INT_CLR_M  (GPIO_COMP1_POS_INT_CLR_V << GPIO_COMP1_POS_INT_CLR_S)
#define GPIO_COMP1_POS_INT_CLR_V  0x00000001U
#define GPIO_COMP1_POS_INT_CLR_S  4
/** GPIO_COMP1_ALL_INT_CLR : WT; bitpos: [5]; default: 0;
 *  analog comparator neg or pos edge interrupt clear
 */
#define GPIO_COMP1_ALL_INT_CLR    (BIT(5))
#define GPIO_COMP1_ALL_INT_CLR_M  (GPIO_COMP1_ALL_INT_CLR_V << GPIO_COMP1_ALL_INT_CLR_S)
#define GPIO_COMP1_ALL_INT_CLR_V  0x00000001U
#define GPIO_COMP1_ALL_INT_CLR_S  5
/** GPIO_BISTOK_INT_CLR : WT; bitpos: [6]; default: 0;
 *  pad bistok interrupt enable
 */
#define GPIO_BISTOK_INT_CLR    (BIT(6))
#define GPIO_BISTOK_INT_CLR_M  (GPIO_BISTOK_INT_CLR_V << GPIO_BISTOK_INT_CLR_S)
#define GPIO_BISTOK_INT_CLR_V  0x00000001U
#define GPIO_BISTOK_INT_CLR_S  6
/** GPIO_BISTFAIL_INT_CLR : WT; bitpos: [7]; default: 0;
 *  pad bistfail interrupt enable
 */
#define GPIO_BISTFAIL_INT_CLR    (BIT(7))
#define GPIO_BISTFAIL_INT_CLR_M  (GPIO_BISTFAIL_INT_CLR_V << GPIO_BISTFAIL_INT_CLR_S)
#define GPIO_BISTFAIL_INT_CLR_V  0x00000001U
#define GPIO_BISTFAIL_INT_CLR_S  7

/** GPIO_ZERO_DET0_FILTER_CNT_REG register
 *  GPIO analog comparator zero detect filter count
 */
#define GPIO_ZERO_DET0_FILTER_CNT_REG (DR_REG_GPIO_BASE + 0x710)
/** GPIO_ZERO_DET0_FILTER_CNT : R/W; bitpos: [31:0]; default: 4294967295;
 *  GPIO analog comparator zero detect filter count
 */
#define GPIO_ZERO_DET0_FILTER_CNT    0xFFFFFFFFU
#define GPIO_ZERO_DET0_FILTER_CNT_M  (GPIO_ZERO_DET0_FILTER_CNT_V << GPIO_ZERO_DET0_FILTER_CNT_S)
#define GPIO_ZERO_DET0_FILTER_CNT_V  0xFFFFFFFFU
#define GPIO_ZERO_DET0_FILTER_CNT_S  0

/** GPIO_ZERO_DET1_FILTER_CNT_REG register
 *  GPIO analog comparator zero detect filter count
 */
#define GPIO_ZERO_DET1_FILTER_CNT_REG (DR_REG_GPIO_BASE + 0x714)
/** GPIO_ZERO_DET1_FILTER_CNT : R/W; bitpos: [31:0]; default: 4294967295;
 *  GPIO analog comparator zero detect filter count
 */
#define GPIO_ZERO_DET1_FILTER_CNT    0xFFFFFFFFU
#define GPIO_ZERO_DET1_FILTER_CNT_M  (GPIO_ZERO_DET1_FILTER_CNT_V << GPIO_ZERO_DET1_FILTER_CNT_S)
#define GPIO_ZERO_DET1_FILTER_CNT_V  0xFFFFFFFFU
#define GPIO_ZERO_DET1_FILTER_CNT_S  0

