espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/gpio_reg.h
/** GPIO_SEND_SEQ_REG register
 *  High speed sdio pad bist send sequence
 */
#define GPIO_SEND_SEQ_REG (DR_REG_GPIO_BASE + 0x718)
/** GPIO_SEND_SEQ : R/W; bitpos: [31:0]; default: 305419896;
 *  High speed sdio pad bist send sequence
 */
#define GPIO_SEND_SEQ    0xFFFFFFFFU
#define GPIO_SEND_SEQ_M  (GPIO_SEND_SEQ_V << GPIO_SEND_SEQ_S)
#define GPIO_SEND_SEQ_V  0xFFFFFFFFU
#define GPIO_SEND_SEQ_S  0

/** GPIO_RECIVE_SEQ_REG register
 *  High speed sdio pad bist receive sequence
 */
#define GPIO_RECIVE_SEQ_REG (DR_REG_GPIO_BASE + 0x71c)
/** GPIO_RECIVE_SEQ : RO; bitpos: [31:0]; default: 0;
 *  High speed sdio pad bist receive sequence
 */
#define GPIO_RECIVE_SEQ    0xFFFFFFFFU
#define GPIO_RECIVE_SEQ_M  (GPIO_RECIVE_SEQ_V << GPIO_RECIVE_SEQ_S)
#define GPIO_RECIVE_SEQ_V  0xFFFFFFFFU
#define GPIO_RECIVE_SEQ_S  0

/** GPIO_BISTIN_SEL_REG register
 *  High speed sdio pad bist in pad sel
 */
#define GPIO_BISTIN_SEL_REG (DR_REG_GPIO_BASE + 0x720)
/** GPIO_BISTIN_SEL : R/W; bitpos: [3:0]; default: 15;
 *  High speed sdio pad bist in pad sel 0:pad39, 1: pad40...
 */
#define GPIO_BISTIN_SEL    0x0000000FU
#define GPIO_BISTIN_SEL_M  (GPIO_BISTIN_SEL_V << GPIO_BISTIN_SEL_S)
#define GPIO_BISTIN_SEL_V  0x0000000FU
#define GPIO_BISTIN_SEL_S  0

/** GPIO_BIST_CTRL_REG register
 *  High speed sdio pad bist control
 */
#define GPIO_BIST_CTRL_REG (DR_REG_GPIO_BASE + 0x724)
/** GPIO_BIST_PAD_OE : R/W; bitpos: [0]; default: 1;
 *  High speed sdio pad bist out pad oe
 */
#define GPIO_BIST_PAD_OE    (BIT(0))
#define GPIO_BIST_PAD_OE_M  (GPIO_BIST_PAD_OE_V << GPIO_BIST_PAD_OE_S)
#define GPIO_BIST_PAD_OE_V  0x00000001U
#define GPIO_BIST_PAD_OE_S  0
/** GPIO_BIST_START : WT; bitpos: [1]; default: 0;
 *  High speed sdio pad bist start
 */
#define GPIO_BIST_START    (BIT(1))
#define GPIO_BIST_START_M  (GPIO_BIST_START_V << GPIO_BIST_START_S)
#define GPIO_BIST_START_V  0x00000001U
#define GPIO_BIST_START_S  1

/** GPIO_DATE_REG register
 *  GPIO version register
 */
#define GPIO_DATE_REG (DR_REG_GPIO_BASE + 0x7fc)
/** GPIO_DATE : R/W; bitpos: [27:0]; default: 2294787;
 *  version register
 */
#define GPIO_DATE    0x0FFFFFFFU
#define GPIO_DATE_M  (GPIO_DATE_V << GPIO_DATE_S)
#define GPIO_DATE_V  0x0FFFFFFFU
#define GPIO_DATE_S  0

#ifdef __cplusplus
}
#endif
